# <u><h1><center><font color = darkgreen>INVESTIGATION OF TMDb MOVIE DATA</font></center></h1></u>
### This data set contains information about 10,000 movies collected from The Movie Database (TMDb), including user ratings and revenue.

# <u><font color = brown>CONTENTS:</font></u>
## 1. <a href="#aim"><font color = red>AIM</font></a>
## 2. <a href="#clean"><font color = red>CLEANING DATA</font></a>
## 3. <a href="#explor"><font color = red>EXPLORATORY ANALYSIS</font></a>
## 4. <a href="#concl"><font color = red>CONCLUSIONS</font></a>
## 5. <a href="#lim_n_fu"><font color = red>LIMITATIONS AND FUTURE WORK</font></a>

<a id='aim'></a>
## 1. <u><font color = red>AIM</font></u>
### To investigate the TMDb movie data and answer the following questions through exploratory data analysis.


## <font color = magenta><u>Questions</u>:</font>
### <font color = magenta>Q1. Which are the three most and least popular genres of each decade?</font>  
### <font color = magenta>Q2. What characteristics distinguish the top 10% profitable movies (all time) from the bottom 10% ?</font>

## 2. <a id='clean'><u><font color = red>CLEANING DATA</font></u></a>

### <font color = green><u>Summary of Steps</u></font>:
### <a href="#step1"><font color = magenta><u>Step 1</u>:</font></a> Create a pandas Dataframe ("tmd") to export the provided TMDb movie data csv file. 
### <a href="#step2"><font color = magenta><u>Step 2</u>:</font></a> Conduct a preliminary exploration of the table ("tmd").
### <a href="#step3"><font color = magenta><u>Step 3</u>:</font></a> Check for duplication of rows in the original dataframe ("tmd").
### <a href="#step4"><font color = magenta><u>Step 4</u>:</font></a> Create a new dataframe ("tmd_q1") from the original dataframe ("tmd"); and clean it for analysis to answer Q1.
### <a href="#step5"><font color = magenta><u>Step 5</u>:</font></a> Create another new dataframe ("tmd_q2") from the original dataframe ("tmd"); and clean it for analysis to answer Q2.

<a id='step1'></a>
### <font color = magenta><u>Step 1</u>:</font>  Create a pandas Dataframe ("tmd") to export the provided TMDb movie data csv file.

In [1]:
# import packages

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# display plots within the notebook
%matplotlib inline 

# to make plots interactive
# %matplotlib notebook

# style of plot
plt.style.use('ggplot')

# to display outputs of all executed lines within a cell
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all" 

# to generate high quality plots
%config InlineBackend.figure_formats = ['svg']

sns.set(rc={"figure.dpi":100, 'savefig.dpi':300})
sns.set_context('notebook')
sns.set_style("ticks")

In [2]:
# create a pandas Dataframe (table) 

tmd = pd.read_csv('tmdb-movies.csv')

<a id='step2'></a>
### <font color = magenta><u>Step 2</u>:</font> Conduct a preliminary exploration of the table ("tmd").

In [3]:
# Basic details about "tmd" contents are studied

print('\033[4m' +'\033[1m' + 'Basic information about "tmd" is provided in this step' \
      + '\033[0m' + '\033[0m' + ' :')

Basic information about "tmd" is provided in this step :

In [4]:
# display the first and last three rows of tmd

print('\033[4m' +'\033[1m' + 'First three rows of "tmd"' + '\033[0m' + '\033[0m' + ' :')

tmd.head(3)

print('\033[4m' +'\033[1m' + 'Last three rows of "tmd"' + '\033[0m' + '\033[0m' + ' :')

tmd.tail(3)

First three rows of "tmd" :

,id,imdb_id,popularity,budget,revenue,original_title,cast,homepage,director,tagline,...,overview,runtime,genres,production_companies,release_date,vote_count,vote_average,release_year,budget_adj,revenue_adj
0,135397,tt0369610,32.985763,150000000,1513528810,Jurassic World,Chris Pratt|Bryce Dallas Howard|Irrfan Khan|Vi...,http://www.jurassicworld.com/,Colin Trevorrow,The park is open.,...,Twenty-two years after the events of Jurassic ...,124,Action|Adventure|Science Fiction|Thriller,Universal Studios|Amblin Entertainment|Legenda...,6/9/15,5562,6.5,2015,1.379999e+08,1.392446e+09
1,76341,tt1392190,28.419936,150000000,378436354,Mad Max: Fury Road,Tom Hardy|Charlize Theron|Hugh Keays-Byrne|Nic...,http://www.madmaxmovie.com/,George Miller,What a Lovely Day.,...,An apocalyptic story set in the furthest reach...,120,Action|Adventure|Science Fiction|Thriller,Village Roadshow Pictures|Kennedy Miller Produ...,5/13/15,6185,7.1,2015,1.379999e+08,3.481613e+08
2,262500,tt2908446,13.112507,110000000,295238201,Insurgent,Shailene Woodley|Theo James|Kate Winslet|Ansel...,http://www.thedivergentseries.movie/#insurgent,Robert Schwentke,One Choice Can Destroy You,...,Beatrice Prior must confront her inner demons ...,119,Adventure|Science Fiction|Thriller,Summit Entertainment|Mandeville Films|Red Wago...,3/18/15,2480,6.3,2015,1.012000e+08,2.716190e+08

Last three rows of "tmd" :

,id,imdb_id,popularity,budget,revenue,original_title,cast,homepage,director,tagline,...,overview,runtime,genres,production_companies,release_date,vote_count,vote_average,release_year,budget_adj,revenue_adj
10863,39768,tt0060161,0.065141,0,0,Beregis Avtomobilya,Innokentiy Smoktunovskiy|Oleg Efremov|Georgi Z...,NaN,Eldar Ryazanov,NaN,...,An insurance agent who moonlights as a carthie...,94,Mystery|Comedy,Mosfilm,1/1/66,11,6.5,1966,0.000000,0.0
10864,21449,tt0061177,0.064317,0,0,"What's Up, Tiger Lily?",Tatsuya Mihashi|Akiko Wakabayashi|Mie Hama|Joh...,NaN,Woody Allen,WOODY ALLEN STRIKES BACK!,...,"In comic Woody Allen's film debut, he took the...",80,Action|Comedy,Benedict Pictures Corp.,11/2/66,22,5.4,1966,0.000000,0.0
10865,22293,tt0060666,0.035919,19000,0,Manos: The Hands of Fate,Harold P. Warren|Tom Neyman|John Reynolds|Dian...,NaN,Harold P. Warren,It's Shocking! It's Beyond Your Imagination!,...,A family gets lost on the road and stumbles up...,74,Horror,Norm-Iris,11/15/66,15,1.5,1966,127642.279154,0.0

In [5]:
# display range of row index, column index and name, data type, and number of non-null values 

print('\033[4m' +'\033[1m' + 'Range of row index, column index and name, data type, \
      and number of non-null values in "tmd"' + '\033[0m' + '\033[0m' + ' :')

tmd.info()

Range of row index, column index and name, data type,       and number of non-null values in "tmd" :
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10866 entries, 0 to 10865
Data columns (total 21 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id                    10866 non-null  int64
 1   imdb_id               10856 non-null  object
 2   popularity            10866 non-null  float64
 3   budget                10866 non-null  int64
 4   revenue               10866 non-null  int64
 5   original_title        10866 non-null  object
 6   cast                  10790 non-null  object
 7   homepage              2936 non-null   object
 8   director              10822 non-null  object
 9   tagline               8042 non-null   object
 10  keywords              9373 non-null   object
 11  overview              10862 non-null  object
 12  runtime               10866 non-null  int64
 13  genres                10843 non-null  object
 14  production_companies  9836 non-null   object
 15  release_date          10866 non-null  object
 16  vote_count            10866 non-null  int64
 17  vote_average          10866 non-null  float64
 18  release_year          10866 non-null  int64
 19  budget_adj            10866 non-null  float64
 20  revenue_adj           10866 non-null  float64
dtypes: float64(4), int64(6), object(11)
memory usage: 1.7+ MB

In [6]:
# display summary statistics of tmd columns with numerical values

print('\033[4m' +'\033[1m' + 'Summary statistics of "tmd"' + '\033[0m' + \
      '\033[0m' + ' :')

tmd.describe()

Summary statistics of "tmd" :

,id,popularity,budget,revenue,runtime,vote_count,vote_average,release_year,budget_adj,revenue_adj
count,10866.000000,10866.000000,1.086600e+04,1.086600e+04,10866.000000,10866.000000,10866.000000,10866.000000,1.086600e+04,1.086600e+04
mean,66064.177434,0.646441,1.462570e+07,3.982332e+07,102.070863,217.389748,5.974922,2001.322658,1.755104e+07,5.136436e+07
std,92130.136561,1.000185,3.091321e+07,1.170035e+08,31.381405,575.619058,0.935142,12.812941,3.430616e+07,1.446325e+08
min,5.000000,0.000065,0.000000e+00,0.000000e+00,0.000000,10.000000,1.500000,1960.000000,0.000000e+00,0.000000e+00
25%,10596.250000,0.207583,0.000000e+00,0.000000e+00,90.000000,17.000000,5.400000,1995.000000,0.000000e+00,0.000000e+00
50%,20669.000000,0.383856,0.000000e+00,0.000000e+00,99.000000,38.000000,6.000000,2006.000000,0.000000e+00,0.000000e+00
75%,75610.000000,0.713817,1.500000e+07,2.400000e+07,111.000000,145.750000,6.600000,2011.000000,2.085325e+07,3.369710e+07
max,417859.000000,32.985763,4.250000e+08,2.781506e+09,900.000000,9767.000000,9.200000,2015.000000,4.250000e+08,2.827124e+09

In [7]:
# display number of unique values in each columns for "tmd"

print('\033[4m' +'\033[1m' + 'Number of unique values in each column of "tmd"' + \
      '\033[0m' + '\033[0m' + ' :')

tmd.nunique()

Number of unique values in each column of "tmd" :

id                      10865
imdb_id                 10855
popularity              10814
budget                    557
revenue                  4702
original_title          10571
cast                    10719
homepage                 2896
director                 5067
tagline                  7997
keywords                 8804
overview                10847
runtime                   247
genres                   2039
production_companies     7445
release_date             5909
vote_count               1289
vote_average               72
release_year               56
budget_adj               2614
revenue_adj              4840
dtype: int64

In [8]:
# display number of null values in each column of tmd

print('\033[4m' +'\033[1m' + 'Number of null values in each column of "tmd"' + \
      '\033[0m' + '\033[0m' + ' :')

tmd.isnull().sum()

Number of null values in each column of "tmd" :

id                         0
imdb_id                   10
popularity                 0
budget                     0
revenue                    0
original_title             0
cast                      76
homepage                7930
director                  44
tagline                 2824
keywords                1493
overview                   4
runtime                    0
genres                    23
production_companies    1030
release_date               0
vote_count                 0
vote_average               0
release_year               0
budget_adj                 0
revenue_adj                0
dtype: int64

In [9]:
# display number of zero values in each column of tmd

print('\033[4m' +'\033[1m' + 'Number of zero values in each column of "tmd"' + '\033[0m' + \
      '\033[0m' + ' :')

tmd.isin([0]).sum()

Number of zero values in each column of "tmd" :

id                         0
imdb_id                    0
popularity                 0
budget                  5696
revenue                 6016
original_title             0
cast                       0
homepage                   0
director                   0
tagline                    0
keywords                   0
overview                   0
runtime                   31
genres                     0
production_companies       0
release_date               0
vote_count                 0
vote_average               0
release_year               0
budget_adj              5696
revenue_adj             6016
dtype: int64

### <a href="#ob1"><font color = magenta><u>Observation 1</u></font></a> :

### <font color = magenta>1.1</font>  The csv file has been successfully extracted to a pandas dataframe. 
### <font color = magenta>1.2</font>  There appears to be many null and zero values in various columns; which should be removed during the cleaning step. 
### <font color = magenta>1.3</font> Also, as there are non-unique values in various columns, we should check for duplicates.
### <font color = magenta>1.4</font>  Between "id" and "imdb_id", the latter can be dropped as it has null values, and as there is no added advantage in keeping both ids to answer our questions.
### <font color = magenta>1.5</font>  Columns "budget" and "revenue" can be dropped as "budget_adj" and "revenue_adj" provide similar but better information (these are inflation adjusted) for analysis.
### <font color = magenta>1.6</font>  Columns "homepage", "tagline", "keywords" and "overview" can be dropped as they contribute to little or no information during analysis.
### <font color = magenta>1.7</font> To answer the first question ( <font color = magenta>Q1:  Which are the three most and least popular genres of each decade?</font>), columns "id", "popularity", "original_title", "genres" and "release_year" are sufficient. However, for analysis, multiple genre combination provided in "genres" column (each separated by "|") should be split into individual rows for each genre.
### <font color = magenta>1.8</font> To answer the second question ( <font color = magenta>Q2 : What characteristics distinguish the top 10% profitable movies (all time) from the bottom 10% ?</font>), all columns except those dropped in 1.4 - 1.6 will be needed.
### <font color = magenta>1.9</font> Thus, as per 1.7 and 1.8, to answer Q1 and Q2, we will create two different dataframes; and thereafter clean each of them separately. 
### <font color = magenta>1.10</font> Before beginning any manipulation, as a first step, we should remove duplicate rows wherein all column values are duplicated.

<a id='step3'></a>
### <font color = magenta><u>Step 3</u>:</font> Check for duplication of rows in the original dataframe ("tmd").

In [10]:
# display total number of duplicates

print('\033[4m' +'\033[1m' + 'Total number of duplicates' + '\033[0m' + \
      '\033[0m' + ' :')

tmd.duplicated().sum()

Total number of duplicates :

1

In [11]:
# display the duplicated rows 

print('\033[4m' +'\033[1m' + 'Duplicated rows' + '\033[0m' + '\033[0m' + ' :')

tmd[tmd.duplicated(keep = False)]

Duplicated rows :

,id,imdb_id,popularity,budget,revenue,original_title,cast,homepage,director,tagline,...,overview,runtime,genres,production_companies,release_date,vote_count,vote_average,release_year,budget_adj,revenue_adj
2089,42194,tt0411951,0.59643,30000000,967000,TEKKEN,Jon Foo|Kelly Overton|Cary-Hiroyuki Tagawa|Ian...,NaN,Dwight H. Little,Survival is no game,...,"In the year of 2039, after World Wars destroy ...",92,Crime|Drama|Action|Thriller|Science Fiction,Namco|Light Song Films,3/20/10,110,5.0,2010,30000000.0,967000.0
2090,42194,tt0411951,0.59643,30000000,967000,TEKKEN,Jon Foo|Kelly Overton|Cary-Hiroyuki Tagawa|Ian...,NaN,Dwight H. Little,Survival is no game,...,"In the year of 2039, after World Wars destroy ...",92,Crime|Drama|Action|Thriller|Science Fiction,Namco|Light Song Films,3/20/10,110,5.0,2010,30000000.0,967000.0

In [12]:
# remove duplicate row

print('\033[1m' + 'One of the duplicates is removed.' + '\033[0m')

tmd.drop([tmd[tmd.duplicated() == True].index[0]], axis = 0, inplace = True)

One of the duplicates is removed.

In [13]:
# testing if duplicated row was removed

print('\033[1m' + 'Cross-checked if the duplicate row is removed.' + '\033[0m')

tmd.duplicated().sum()

Cross-checked if the duplicate row is removed.

0

In [14]:
# reset the row index of table

print('\033[1m' + 'Row index are reset after removal of the duplicate rows.' \
      + '\033[0m')

tmd.reset_index(drop = True, inplace = True)

Row index are reset after removal of the duplicate rows.

In [15]:
# number of rows in the table is reduced by one as shown below

print('\033[1m' + 'Number of rows are reduced after removal of duplicates.' + \
      '\033[0m')

tmd.shape[0]

Number of rows are reduced after removal of duplicates.

10865

### <a id='step4'><font color = magenta><u>Step 4</u>:</font></a> Create a new dataframe ("tmd_q1") from the original dataframe ("tmd"); and clean it (as discussed in observation 1) for analysis to answer Q1.

In [16]:
# display columns and their index

print('\033[4m' +'\033[1m' + 'Column index and name in "tmd" are' + '\033[0m' + \
      '\033[0m' + ' :')

for (i, j) in enumerate(tmd.columns):
    print(i, j)

Column index and name in "tmd" are :
0 id
1 imdb_id
2 popularity
3 budget
4 revenue
5 original_title
6 cast
7 homepage
8 director
9 tagline
10 keywords
11 overview
12 runtime
13 genres
14 production_companies
15 release_date
16 vote_count
17 vote_average
18 release_year
19 budget_adj
20 revenue_adj

In [17]:
# use the column index to copy relevant columns into a new dataframe "tmd_q1"

print('\033[1m' + 'Relevant columns from "tmd" are copied to create the new \
dataframe "tmd_q1"' + '\033[0m')

tmd_q1 = tmd.iloc[:,[0, 2, 5, 13, 18]].copy()

Relevant columns from "tmd" are copied to create the new dataframe "tmd_q1"

In [18]:
# display first and last three rows of the "tmd_q1"

print('\033[4m' +'\033[1m' + 'First three rows of "tmd_q1"' + '\033[0m' + \
      '\033[0m' + ' :')

tmd_q1.head(3)

print('\033[4m' +'\033[1m' + 'Last three rows of "tmd_q1"' + '\033[0m' + \
      '\033[0m' + ' :')

tmd_q1.tail(3)

First three rows of "tmd_q1" :

,id,popularity,original_title,genres,release_year
0,135397,32.985763,Jurassic World,Action|Adventure|Science Fiction|Thriller,2015
1,76341,28.419936,Mad Max: Fury Road,Action|Adventure|Science Fiction|Thriller,2015
2,262500,13.112507,Insurgent,Adventure|Science Fiction|Thriller,2015

Last three rows of "tmd_q1" :

,id,popularity,original_title,genres,release_year
10862,39768,0.065141,Beregis Avtomobilya,Mystery|Comedy,1966
10863,21449,0.064317,"What's Up, Tiger Lily?",Action|Comedy,1966
10864,22293,0.035919,Manos: The Hands of Fate,Horror,1966

In [19]:
# checking for null values

print('\033[4m' +'\033[1m' + 'Number of null values in each column of "tmd_q1"' + \
      '\033[0m' + '\033[0m' + ' :')

tmd_q1.isnull().sum()

Number of null values in each column of "tmd_q1" :

id                 0
popularity         0
original_title     0
genres            23
release_year       0
dtype: int64

In [20]:
#checking for zeros

print('\033[4m' +'\033[1m' + 'Number of zero values in each column of "tmd_q1"' + \
      '\033[0m' + '\033[0m' + ' :')

tmd_q1.isin([0]).sum()

Number of zero values in each column of "tmd_q1" :

id                0
popularity        0
original_title    0
genres            0
release_year      0
dtype: int64

In [21]:
# remove rows with null values in genre column

print('\033[1m' + 'Removing rows with null values.' + '\033[0m')

tmd_q1.dropna(inplace = True)

Removing rows with null values.

In [22]:
# confirming that the rows with nulls in "genre" column have been removed

print('\033[1m' + 'Checking if removal of rows with null values is successfull.' \
      + '\033[0m')

tmd_q1.isnull().sum()

Checking if removal of rows with null values is successfull.

id                0
popularity        0
original_title    0
genres            0
release_year      0
dtype: int64

In [23]:
# reset the index numbering of rows

print('\033[1m' + 'The row index are reset.' + '\033[0m')

tmd_q1.reset_index(drop = True, inplace = True)

The row index are reset.

In [24]:
# check for number of rows and columns as a test

print('\033[4m' +'\033[1m' + 'The final shape of "tmd_q1"' + '\033[0m' + \
      '\033[0m' + ' :')

tmd_q1.shape

The final shape of "tmd_q1" :

(10842, 5)

### <font color = magenta><u>Note 1</u></font> : 
### It should be noted that when we previously checked for duplicate rows (in the original dataframe "tmd"), we considered all the columns of the table. However, if we consider fewer columns (of  "tmd"), we may still obtain duplicates. 

### To ensure the absence of movie duplicates, we will have to list and visualize different cases considering various combinations of relevant columns. These tests are demonstrated below for the dataframe "tmd_q1".

In [25]:
# number of duplicate rows considering all 5 columns in "tmd_q1"

print('\033[4m' +'\033[1m' + 'Number of duplicates in "tmd_q1" considering all 5 of \
it\'s columns' + '\033[0m' + '\033[0m' + ' :')

tmd_q1.duplicated().sum()

Number of duplicates in "tmd_q1" considering all 5 of it's columns :

0

In [26]:
# number of duplicate rows considering "original_title" and "release_year" columns

print('\033[4m' +'\033[1m' + 'Number of duplicates in "tmd_q1" considering columns \
"original_title" and "release_year" only' + '\033[0m' + '\033[0m' + ' :')

tmd_q1.duplicated(['original_title', 'release_year']).sum()

Number of duplicates in "tmd_q1" considering columns "original_title" and "release_year" only :

3

In [27]:
# listing all these rows

print('\033[4m' +'\033[1m' + 'Displaying duplicated rows in "tmd_q1" considering only \
"original_title" and "release_year"' + '\033[0m' + '\033[0m' + ' :')

tmd_q1[tmd_q1.duplicated(['original_title', 'release_year'], keep = False)]

Displaying duplicated rows in "tmd_q1" considering only "original_title" and "release_year" :

,id,popularity,original_title,genres,release_year
2500,11944,0.406308,Joan of Arc,Drama|History,1999
2563,10047,0.235223,Joan of Arc,Adventure|Drama|Action|History|War,1999
5710,217316,0.364669,1,Documentary,2013
5734,176068,0.336081,1,Thriller|Science Fiction,2013
8531,3573,0.477489,Emma,Comedy|Drama|Romance,1996
8626,12254,0.161600,Emma,TV Movie|Comedy|Drama|Romance,1996

In [28]:
# Confirming if these movies are actually duplicates.

print('\033[4m' +'\033[1m' + 'Extracting all columns from "tmd" corresponding \
to the ids of duplicate rows in "tmd_q1" so as to confirm if they are actually \
duplicates' + '\033[0m' + '\033[0m' + '\033[0m' + ' :')

tmd.loc[tmd['id'].isin([11944, 10047, 217316, 176068, 3573, 12254])]

Extracting all columns from "tmd" corresponding to the ids of duplicate rows in "tmd_q1" so as to confirm if they are actually duplicates :

,id,imdb_id,popularity,budget,revenue,original_title,cast,homepage,director,tagline,...,overview,runtime,genres,production_companies,release_date,vote_count,vote_average,release_year,budget_adj,revenue_adj
2507,11944,tt0178145,0.406308,20000000,0,Joan of Arc,Leelee Sobieski|Powers Boothe|Neil Patrick Har...,NaN,Christian Duguay,She died at 19. 500 years later her legend liv...,...,"Ten years before her death, Joan hears voices....",140,Drama|History,NaN,5/16/99,13,5.8,1999,2.618106e+07,0.000000e+00
2570,10047,tt0151137,0.235223,60000000,66976317,Joan of Arc,Milla Jovovich|Dustin Hoffman|Faye Dunaway|Joh...,NaN,Luc Besson,NaN,...,In 1429 a teenage girl from a remote French vi...,148,Adventure|Drama|Action|History|War,Columbia Pictures|Gaumont,10/18/99,209,6.1,1999,7.854317e+07,8.767554e+07
5723,217316,tt2518788,0.364669,0,0,1,Michael Fassbender|Niki Lauda|Michael Schumach...,https://www.facebook.com/1thefilm,Paul Crowder,The True Story of the Drivers Who Risked Their...,...,Set in the golden era of Grand Prix Racing '1'...,112,Documentary,Exclusive Media Group|Universum Film (UFA)|Spi...,9/30/13,25,7.6,2013,0.000000e+00,0.000000e+00
5747,176068,tt2395385,0.336081,0,0,1,Rhys Wakefield|Logan Miller|Ashley Hinshaw|Nat...,NaN,Dennis Iliadis,Everyone wants one.,...,Three college friends go to the biggest party ...,95,Thriller|Science Fiction,Process Productions,9/20/13,49,5.1,2013,0.000000e+00,0.000000e+00
8549,3573,tt0116191,0.477489,6000000,22231658,Emma,Gwyneth Paltrow|Toni Collette|Alan Cumming|Ewa...,http://www.miramax.com/movie/emma/,Douglas McGrath,Cupid is armed and dangerous!,...,Emma Woodhouse is a congenial young lady who d...,121,Comedy|Drama|Romance,Miramax Films|Haft Entertainment|Matchmaker Films,8/2/96,77,6.5,1996,8.341300e+06,3.090682e+07
8645,12254,tt0118308,0.161600,0,0,Emma,Kate Beckinsale|Bernard Hepton|Mark Strong|Sam...,NaN,Diarmuid Lawrence,NaN,...,Emma Woodhouse has a rigid sense of propriety ...,107,TV Movie|Comedy|Drama|Romance,Meridian Broadcasting Ltd,8/1/96,15,6.6,1996,0.000000e+00,0.000000e+00

### <font color = magenta><u>Observation 2</u></font> : 

### Though there are three pairs of movies with same "original_title" and "release_year", movies in each pairs have different values in remaining columns (including "director", "release_date", etc.). Therefore, none of them can be considered duplicates.

In [29]:
# in each row, multiple genres separated by "|" are converted to a list of genres

print('\033[4m' +'\033[1m' + 'In each row of "tmd_q1", multiple genres \
separated by "|" are converted to a list of genres as shown below' + \
      '\033[0m' + '\033[0m' + ' :')

tmd_q1['genres'] = tmd_q1['genres'].str.split('|')
tmd_q1['genres']

In each row of "tmd_q1", multiple genres separated by "|" are converted to a list of genres as shown below :

0        [Action, Adventure, Science Fiction, Thriller]
1        [Action, Adventure, Science Fiction, Thriller]
2                [Adventure, Science Fiction, Thriller]
3         [Action, Adventure, Science Fiction, Fantasy]
4                             [Action, Crime, Thriller]
                              ...
10837                                     [Documentary]
10838                        [Action, Adventure, Drama]
10839                                 [Mystery, Comedy]
10840                                  [Action, Comedy]
10841                                          [Horror]
Name: genres, Length: 10842, dtype: object

In [30]:
# separate row is assigned to each genre within the list of genres in all rows of the table

print('\033[1m' + 'Separate row is assigned to each genre within these lists \
of genres.' + '\033[0m')

tmd_q1 = tmd_q1.explode('genres')

Separate row is assigned to each genre within these lists of genres.

In [31]:
# reset the row index numbering 

print('\033[1m' + 'The row index are reset.' + '\033[0m')

tmd_q1.reset_index(drop = True, inplace = True)

The row index are reset.

In [32]:
# first and last five rows of cleaned "tmd_q1"

print('\033[4m' +'\033[1m' + 'First five rows of cleaned "tmd_q1"' + '\033[0m' + \
      '\033[0m' + ' :')

tmd_q1.head()

print('\033[4m' +'\033[1m' + 'Last five rows of cleaned "tmd_q1"' + '\033[0m' + \
      '\033[0m' + ' :')

tmd_q1.tail()

First five rows of cleaned "tmd_q1" :

       id  popularity      original_title           genres  release_year
0  135397   32.985763      Jurassic World           Action          2015
1  135397   32.985763      Jurassic World        Adventure          2015
2  135397   32.985763      Jurassic World  Science Fiction          2015
3  135397   32.985763      Jurassic World         Thriller          2015
4   76341   28.419936  Mad Max: Fury Road           Action          2015

Last five rows of cleaned "tmd_q1" :

          id  popularity            original_title   genres  release_year
26950  39768    0.065141       Beregis Avtomobilya  Mystery          1966
26951  39768    0.065141       Beregis Avtomobilya   Comedy          1966
26952  21449    0.064317    What's Up, Tiger Lily?   Action          1966
26953  21449    0.064317    What's Up, Tiger Lily?   Comedy          1966
26954  22293    0.035919  Manos: The Hands of Fate   Horror          1966

In [33]:
# cleaned data for answering Q1 is saved as a csv file "tmd_q1_cleaned.csv"

print('\033[1m' + 'Saving cleaned data as a csv file "tmd_q1_cleaned.csv" \
for analysis to answer Q1.' + '\033[0m')

tmd_q1.to_csv('tmd_q1_cleaned.csv', index = False)

Saving cleaned data as a csv file "tmd_q1_cleaned.csv" for analysis to answer Q1.

### <a id='step5'><font color = magenta><u>Step 5</u>:</font></a> Create another new dataframe ("tmd_q2") from the original dataframe ("tmd"); and clean it for analysis to answer Q2.

In [34]:
# display column index and name of "tmd_q2"

print('\033[4m' +'\033[1m' + 'Index and name of columns in "tmd_q2"' + \
      '\033[0m' + '\033[0m' + ' :')

for (i, j) in enumerate(tmd.columns):
    print(i, j)

Index and name of columns in "tmd_q2" :
0 id
1 imdb_id
2 popularity
3 budget
4 revenue
5 original_title
6 cast
7 homepage
8 director
9 tagline
10 keywords
11 overview
12 runtime
13 genres
14 production_companies
15 release_date
16 vote_count
17 vote_average
18 release_year
19 budget_adj
20 revenue_adj

In [35]:
# use the column index to copy relevant columns into a new dataframe "tmd_q2"

print('\033[1m' + 'Relevant columns from "tmd" are copied to create the \
new dataframe "tmd_q2"' + '\033[0m')

tmd_q2 = tmd.iloc[:,np.r_[0, 2, 5, 6, 8, 12:21]].copy()

Relevant columns from "tmd" are copied to create the new dataframe "tmd_q2"

In [36]:
# display the first and last three rows of "tmd_q2"

print('\033[4m' +'\033[1m' + 'First three rows of "tmd_q2"' + '\033[0m' + \
      '\033[0m' + ' :')

tmd_q2.head(3)

print('\033[4m' +'\033[1m' + 'Last three rows of "tmd_q2"' + '\033[0m' + \
      '\033[0m' + ' :')

tmd_q2.tail(3)

First three rows of "tmd_q2" :

,id,popularity,original_title,cast,director,runtime,genres,production_companies,release_date,vote_count,vote_average,release_year,budget_adj,revenue_adj
0,135397,32.985763,Jurassic World,Chris Pratt|Bryce Dallas Howard|Irrfan Khan|Vi...,Colin Trevorrow,124,Action|Adventure|Science Fiction|Thriller,Universal Studios|Amblin Entertainment|Legenda...,6/9/15,5562,6.5,2015,1.379999e+08,1.392446e+09
1,76341,28.419936,Mad Max: Fury Road,Tom Hardy|Charlize Theron|Hugh Keays-Byrne|Nic...,George Miller,120,Action|Adventure|Science Fiction|Thriller,Village Roadshow Pictures|Kennedy Miller Produ...,5/13/15,6185,7.1,2015,1.379999e+08,3.481613e+08
2,262500,13.112507,Insurgent,Shailene Woodley|Theo James|Kate Winslet|Ansel...,Robert Schwentke,119,Adventure|Science Fiction|Thriller,Summit Entertainment|Mandeville Films|Red Wago...,3/18/15,2480,6.3,2015,1.012000e+08,2.716190e+08

Last three rows of "tmd_q2" :

,id,popularity,original_title,cast,director,runtime,genres,production_companies,release_date,vote_count,vote_average,release_year,budget_adj,revenue_adj
10862,39768,0.065141,Beregis Avtomobilya,Innokentiy Smoktunovskiy|Oleg Efremov|Georgi Z...,Eldar Ryazanov,94,Mystery|Comedy,Mosfilm,1/1/66,11,6.5,1966,0.000000,0.0
10863,21449,0.064317,"What's Up, Tiger Lily?",Tatsuya Mihashi|Akiko Wakabayashi|Mie Hama|Joh...,Woody Allen,80,Action|Comedy,Benedict Pictures Corp.,11/2/66,22,5.4,1966,0.000000,0.0
10864,22293,0.035919,Manos: The Hands of Fate,Harold P. Warren|Tom Neyman|John Reynolds|Dian...,Harold P. Warren,74,Horror,Norm-Iris,11/15/66,15,1.5,1966,127642.279154,0.0

In [37]:
# display the number of null values in each column of "tmd_q2"

print('\033[4m' +'\033[1m' + 'Number of null values in each column of \
"tmd_q2"' + '\033[0m' + '\033[0m' + ' :')

tmd_q2.isnull().sum()

Number of null values in each column of "tmd_q2" :

id                         0
popularity                 0
original_title             0
cast                      76
director                  44
runtime                    0
genres                    23
production_companies    1030
release_date               0
vote_count                 0
vote_average               0
release_year               0
budget_adj                 0
revenue_adj                0
dtype: int64

In [38]:
# display the number of zero values in each column of "tmd_q2"

print('\033[4m' +'\033[1m' + 'Number of zero values in each column of "tmd_q2"' + \
      '\033[0m' + '\033[0m' + ' :')

tmd_q2.isin([0]).sum()

Number of zero values in each column of "tmd_q2" :

id                         0
popularity                 0
original_title             0
cast                       0
director                   0
runtime                   31
genres                     0
production_companies       0
release_date               0
vote_count                 0
vote_average               0
release_year               0
budget_adj              5696
revenue_adj             6016
dtype: int64

In [39]:
# display range of row index, column index and name, data type, and number of non-null values in "tmd_q2" 

print('\033[4m' + '\033[1m' + 'Range of row index, column index and name, \
data type, and number of non-null values in "tmd_q2"' + '\033[0m' \
      + '\033[0m' + ' :')

tmd_q2.info()

Range of row index, column index and name, data type, and number of non-null values in "tmd_q2" :
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10865 entries, 0 to 10864
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id                    10865 non-null  int64
 1   popularity            10865 non-null  float64
 2   original_title        10865 non-null  object
 3   cast                  10789 non-null  object
 4   director              10821 non-null  object
 5   runtime               10865 non-null  int64
 6   genres                10842 non-null  object
 7   production_companies  9835 non-null   object
 8   release_date          10865 non-null  object
 9   vote_count            10865 non-null  int64
 10  vote_average          10865 non-null  float64
 11  release_year          10865 non-null  int64
 12  budget_adj            10865 non-null  float64
 13  revenue_adj           10865 non-null  float64
dtypes: float64(4), int64(4), object(6)
memory usage: 1.2+ MB

In [40]:
# display summary statistics of "tmd_q2"

print('\033[4m' + '\033[1m' + 'Summary statistics of tmd_q2 is given below' \
      + '\033[0m' + '\033[0m' + ' :')

tmd_q2.describe()

Summary statistics of tmd_q2 is given below :

,id,popularity,runtime,vote_count,vote_average,release_year,budget_adj,revenue_adj
count,10865.000000,10865.000000,10865.000000,10865.000000,10865.000000,10865.000000,1.086500e+04,1.086500e+04
mean,66066.374413,0.646446,102.071790,217.399632,5.975012,2001.321859,1.754989e+07,5.136900e+07
std,92134.091971,1.000231,31.382701,575.644627,0.935138,12.813260,3.430753e+07,1.446383e+08
min,5.000000,0.000065,0.000000,10.000000,1.500000,1960.000000,0.000000e+00,0.000000e+00
25%,10596.000000,0.207575,90.000000,17.000000,5.400000,1995.000000,0.000000e+00,0.000000e+00
50%,20662.000000,0.383831,99.000000,38.000000,6.000000,2006.000000,0.000000e+00,0.000000e+00
75%,75612.000000,0.713857,111.000000,146.000000,6.600000,2011.000000,2.085325e+07,3.370173e+07
max,417859.000000,32.985763,900.000000,9767.000000,9.200000,2015.000000,4.250000e+08,2.827124e+09

### <font color = magenta><u>Observation 3</u></font> :

### <font color = magenta>3.1</font> In order to answer question 2 (<font color = magenta>Q2. What characteristics distinguish the top 10% profitable movies (all time) from the bottom 10%?</font>), relationship between a (new) derived variable "profit_percentage"  ( =  ("revenue_adj" - "budget_adj") / "budget_adj") and the other column variables should be studied.
### <font color = magenta>3.2</font> There are a large number of zero values in columns "budget_adj" and "revenue_adj". As there is always a non-zero cost associated with movie-making, rows with zero values in the "budget_adj" column should definitely be removed. Though highly unlikely, values in "revenue_adj" column can be zero. However, here we will remove rows with zero value in either "budget_adj" or "revenue_adj". 
### <font color = magenta>3.3</font> The column "runtime" also contain few zero values. This should only be handled after removing rows with zeros in "budget_adj" and "revenue_adj" (if at all "runtime" still contains zero values after removing large number of rows as discussed in 3.2 !).
### <font color = magenta>3.4</font> There are no null values in "budget_adj" and "revenue_adj" columns. Rows with null values in other columns should not be removed immediately, as it can cause lose of non-null values (from other columns in the corresponding rows) which will be useful for analysis. Rather, we will remove them individually, if needed, while analysing relationship between profit and such column variables. (again, only if such cases still exist after removing large number of rows as discussed in 3.2 ! )

In [41]:
# rows with zeros in columns "budget_adj" or "revenue_adj" is copied to a new dataframe "tmd_q2_bud_rev_zero" 
 
print('\033[1m' + 'Copying rows that contain zeros in columns "budget_adj" \
or "revenue_adj" into a new dataframe "tmd_q2_bud_rev_zero"' + '\033[0m')

tmd_q2_bud_rev_zero = tmd_q2[tmd_q2['budget_adj'].isin([0]) | tmd_q2['revenue_adj'].isin([0])].copy()

Copying rows that contain zeros in columns "budget_adj" or "revenue_adj" into a new dataframe "tmd_q2_bud_rev_zero"

In [42]:
# remove rows with zeros in columns "budget_adj" or "revenue_adj"

print('\033[1m' + 'Removing rows from "tmd_q2" that contain zeros in columns \
"budget_adj" or "revenue_adj"' + '\033[0m')

tmd_q2.drop(list(tmd_q2_bud_rev_zero.index), axis = 0, inplace = True)

Removing rows from "tmd_q2" that contain zeros in columns "budget_adj" or "revenue_adj"

In [43]:
# reset the row index numbering

print('\033[1m' + 'Reset row index of "tmd_q2" that contain zeros in columns \
"budget_adj" or "revenue_adj"' + '\033[0m')

tmd_q2.reset_index(drop = True, inplace = True)

Reset row index of "tmd_q2" that contain zeros in columns "budget_adj" or "revenue_adj"

In [44]:
# new shape of "tmd_q2"

print('\033[4m' +'\033[1m' + 'New shape of "tmd_q2"' + '\033[0m' + '\033[0m' + ' :')

tmd_q2.shape

New shape of "tmd_q2" :

(3854, 14)

In [45]:
# check to see if any column contains zero

print('\033[4m' +'\033[1m' + 'Checking if removal of zeros from all columns \
were successfull' + '\033[0m' + '\033[0m' + ' :')

tmd_q2.isin([0]).sum()

Checking if removal of zeros from all columns were successfull :

id                      0
popularity              0
original_title          0
cast                    0
director                0
runtime                 0
genres                  0
production_companies    0
release_date            0
vote_count              0
vote_average            0
release_year            0
budget_adj              0
revenue_adj             0
dtype: int64

In [46]:
# display number of null values in all columns

print('\033[4m' +'\033[1m' + 'Number of null values in columns of "tmd_q2"' \
      + '\033[0m' + '\033[0m' + ' :')

tmd_q2.isnull().sum()

Number of null values in columns of "tmd_q2" :

id                       0
popularity               0
original_title           0
cast                     4
director                 1
runtime                  0
genres                   0
production_companies    46
release_date             0
vote_count               0
vote_average             0
release_year             0
budget_adj               0
revenue_adj              0
dtype: int64

In [47]:
# display summary statistics

print('\033[4m' +'\033[1m' + 'Summary statistics of "tmd_q2"' + '\033[0m' \
      + '\033[0m' + ' :')

tmd_q2.describe()

Summary statistics of "tmd_q2" :

,id,popularity,runtime,vote_count,vote_average,release_year,budget_adj,revenue_adj
count,3854.000000,3854.000000,3854.000000,3854.000000,3854.000000,3854.000000,3.854000e+03,3.854000e+03
mean,39888.185262,1.191554,109.220291,527.720291,6.168163,2001.261028,4.423999e+07,1.370647e+08
std,67222.527399,1.475162,19.922820,879.956821,0.794920,11.282575,4.480925e+07,2.161114e+08
min,5.000000,0.001117,15.000000,10.000000,2.200000,1960.000000,9.693980e-01,2.370705e+00
25%,6073.500000,0.462367,95.000000,71.000000,5.700000,1995.000000,1.309053e+07,1.835735e+07
50%,11321.500000,0.797511,106.000000,204.000000,6.200000,2004.000000,3.001611e+07,6.173068e+07
75%,38573.250000,1.368324,119.000000,580.000000,6.700000,2010.000000,6.061307e+07,1.632577e+08
max,417859.000000,32.985763,338.000000,9767.000000,8.400000,2015.000000,4.250000e+08,2.827124e+09

### <font color = magenta><u>Observation 4</u></font> :

### <font color = magenta>4.1</font> In the context of money involved in movie-making, both "budget_adj" and "revenue_adj" columns consist of unrealistic values which are too low to be valid. 

### <font color = magenta>4.2</font> The order of magnitude of money involved is usually above hundred-thousand dollars. Here, all rows with "budget_adj" or "revenue_adj" column containing lower numerical values (say, less than 10 thousand dollars) will be removed.

### <font color = magenta>4.3</font> A new column "profit_percentage"  ( =  ("revenue_adj" - "budget_adj") / "budget_adj" ) should be added for analysis of question 2 (<font color = magenta>Q2. What characteristics distinguish the top 10% profitable movies (all time) from the bottom 10%?</font>).

### <font color = magenta>4.4</font> After these manipulations, two new dataframes, "tmd_q2_top10" and "tmd_q2_bottom10", can be created to include movies from top 10% of highest profitable movies of all time and bottom 10% respectively. Exploratory analysis will be conducted on these dataframes to identify distiguishing properties, if any, between them.

In [48]:
# dropping rows with "budget_adj" or "revenue_adj" less than 10 thousand dollars.

print('\033[1m' + 'Unrealistic values from "budget_adj" and "revenue_adj" \
columns (here, < 10,000 dollars) are removed.' + '\033[0m')

tmd_q2 = tmd_q2[(tmd_q2['budget_adj'] > 0.1e5) & (tmd_q2['revenue_adj'] > 0.1e5)]

Unrealistic values from "budget_adj" and "revenue_adj" columns (here, < 10,000 dollars) are removed.

In [49]:
# add column "profit_percentage" to "tmd_q2"

print('\033[1m' + 'New column "profit_percentage" is added to "tmd_q2".' \
      + '\033[0m')

tmd_q2['profit_percentage'] = \
(tmd_q2['revenue_adj'] - tmd_q2['budget_adj']) / tmd_q2['budget_adj']

New column "profit_percentage" is added to "tmd_q2".

In [50]:
# sort rows in "tmd_q2" in decreasing value of "profit_percentage" column.

print('\033[1m' + 'Rows in "tmd_q2" are sorted in decreasing value of \
"profit_percentage" column.' + '\033[0m')

tmd_q2 = tmd_q2.sort_values('profit_percentage', ascending = False)

Rows in "tmd_q2" are sorted in decreasing value of "profit_percentage" column.

In [51]:
# reset index of rows in "tmd_q2"

print('\033[1m' + 'Row index of "tmd_q2" is reset.' + '\033[0m')

tmd_q2.reset_index(drop = True, inplace = True)

Row index of "tmd_q2" is reset.

In [52]:
# cleaned data for answering Q2 is saved as a csv file "tmd_q2_cleaned.csv"
# data in this file was sorted according to decreasing values of "profit_percentage".

print('\033[1m' + 'Saving cleaned data as a csv file "tmd_q2_cleaned.csv" \
for analysis to answer Q2.' + '\033[0m')

tmd_q2.to_csv('tmd_q2_cleaned.csv', index = False)

Saving cleaned data as a csv file "tmd_q2_cleaned.csv" for analysis to answer Q2.

In [53]:
# number of rows and columns in "tmd_q2"

print('\033[4m' + '\033[1m' + 'Number of rows and columns in "tmd_q2"' + \
      '\033[0m'+ '\033[0m' + ' :')

tmd_q2.shape

Number of rows and columns in "tmd_q2" :

(3801, 15)

In [54]:
# create a new dataframe for top 2% of highest profitable movies.

print('\033[1m' + 'New dataframe "tmd_q2_top10" is created for top 10% \
of most profitable movies' + '\033[0m')

tmd_q2_top10 = tmd_q2.iloc[:int(tmd_q2.shape[0]*10/100)]

New dataframe "tmd_q2_top10" is created for top 10% of most profitable movies

In [55]:
# create another new dataframe for movies not in the top 2% of highest profitable movies.

print('\033[1m' + 'New dataframe "tmd_q2_bottom10" is created for movies \
in the bottom 10% of most profitable movies' + '\033[0m')

tmd_q2_bottom10 = tmd_q2.iloc[-int(tmd_q2.shape[0]*10/100):]

New dataframe "tmd_q2_bottom10" is created for movies in the bottom 10% of most profitable movies

In [56]:
# reset row index for "tmd_q2_bottom"

print('\033[1m' + 'Row index of "tmd_q2_bottom10" is reset.' + '\033[0m')

tmd_q2_bottom10.reset_index(drop = True, inplace = True)

Row index of "tmd_q2_bottom10" is reset.

In [57]:
# display the first and last three rows of "tmd_q2_top10"

print('\033[4m' +'\033[1m' + 'First three rows of "tmd_q2_top10"' \
      + '\033[0m' + '\033[0m' + ' :')

tmd_q2_top10.head(3)

print('\033[4m' +'\033[1m' + 'Last three rows of "tmd_q2_top10"' + \
      '\033[0m' + '\033[0m' + ' :')

tmd_q2_top10.tail(3)

First three rows of "tmd_q2_top10" :

,id,popularity,original_title,cast,director,runtime,genres,production_companies,release_date,vote_count,vote_average,release_year,budget_adj,revenue_adj,profit_percentage
0,23827,1.120442,Paranormal Activity,Katie Featherston|Micah Sloat|Mark Fredrichs|A...,Oren Peli,86,Horror|Mystery,Blumhouse Productions|Solana Films,9/14/07,714,6.1,2007,15775.028739,2.033462e+08,12889.386667
1,2667,0.934621,The Blair Witch Project,Heather Donahue|Michael C. Williams|Joshua Leo...,Daniel Myrick|Eduardo SÃƒÂ¡nchez,81,Horror|Mystery,Artisan Entertainment|Haxan Films,7/14/99,522,6.3,1999,32726.321165,3.246451e+08,9919.000000
2,985,0.331417,Eraserhead,Jack Nance|Charlotte Stewart|Allen Joseph|Jean...,David Lynch,89,Science Fiction|Fantasy|Horror|Drama,American Film Institute (AFI)|Libra Films,3/19/77,194,7.1,1977,35977.810326,2.518447e+07,699.000000

Last three rows of "tmd_q2_top10" :

,id,popularity,original_title,cast,director,runtime,genres,production_companies,release_date,vote_count,vote_average,release_year,budget_adj,revenue_adj,profit_percentage
377,109445,6.112766,Frozen,Kristen Bell|Idina Menzel|Jonathan Groff|Josh ...,Chris Buck|Jennifer Lee,102,Animation|Adventure|Family,Walt Disney Pictures|Walt Disney Animation Stu...,11/27/13,3369,7.5,2013,1.404050e+08,1.192711e+09,7.494793
378,8363,1.776713,Superbad,Jonah Hill|Michael Cera|Christopher Mintz-Plas...,Greg Mottola,113,Comedy,Columbia Pictures|Apatow Productions,8/17/07,1325,7.0,2007,2.103337e+07,1.786371e+08,7.493033
379,43933,0.827664,Monsters,Whitney Able|Scoot McNairy|Annalee Jefferies|K...,Gareth Edwards,94,Drama|Thriller|Science Fiction,Vertigo Entertainment,6/18/10,328,6.3,2010,5.000000e+05,4.242978e+06,7.485956

In [58]:
# display the first and last three rows of "tmd_q2_bottom10"

print('\033[4m' +'\033[1m' + 'First three rows of "tmd_q2_bottom10"' + \
      '\033[0m' + '\033[0m' + ' :')

tmd_q2_bottom10.head(3)

print('\033[4m' +'\033[1m' + 'Last three rows of "tmd_q2_bottom10"' + \
      '\033[0m' + '\033[0m' + ' :')

tmd_q2_bottom10.tail(3)

First three rows of "tmd_q2_bottom10" :

,id,popularity,original_title,cast,director,runtime,genres,production_companies,release_date,vote_count,vote_average,release_year,budget_adj,revenue_adj,profit_percentage
0,13600,0.721663,City of Ember,Saoirse Ronan|Harry Treadaway|Mary Kay Place|B...,Gil Kenan,90,Adventure|Family|Fantasy,Playtone|Walden Media,10/7/08,358,6.1,2008,5.570326e+07,1.809753e+07,-0.675108
1,2453,0.633950,Harley Davidson and the Marlboro Man,Mickey Rourke|Don Johnson|Chelsea Field|Daniel...,Simon Wincer,98,Action|Thriller,Metro-Goldwyn-Mayer (MGM)|Krisjair|Laredo,8/23/91,44,6.4,1991,3.682514e+07,1.190369e+07,-0.676751
2,256962,0.829111,Little Boy,Jakob Salvati|Emily Watson|Cary-Hiroyuki Tagaw...,Alejandro Monteverde,106,Comedy|Drama|War,Metanoia Films,4/23/15,113,7.1,2015,1.839999e+07,5.906691e+06,-0.678984

Last three rows of "tmd_q2_bottom10" :

,id,popularity,original_title,cast,director,runtime,genres,production_companies,release_date,vote_count,vote_average,release_year,budget_adj,revenue_adj,profit_percentage
377,116977,0.111351,Foodfight!,Charlie Sheen|Wayne Brady|Hilary Duff|Eva Long...,Lawrence Kasanoff,87,Animation|Action|Comedy|Family,Threshold Entertainment|Lions Gate Family Ente...,6/15/12,12,2.2,2012,6.173338e+07,70001.852001,-0.998866
378,50601,0.539108,5 Days of War,Rupert Friend|Val Kilmer|Andy GarcÃƒÂ­a|Dean Cai...,Renny Harlin,113,War|Drama,Midnight Sun Pictures|Dispictures|Georgia Inte...,4/14/11,29,5.9,2011,1.938796e+07,16944.108386,-0.999126
379,5289,0.792950,Chaos,Jason Statham|Ryan Phillippe|Wesley Snipes|Hen...,Tony Giglio,106,Drama|Action|Crime,Current Entertainment|Epsilon Motion Pictures|...,1/17/05,162,6.3,2005,1.339876e+07,11488.319687,-0.999143

In [59]:
# save "tmd_q2_top10" and "tmd_q2_bottom10" as csv files.

print('\033[1m' + 'Saving cleaned data as csv files "tmd_q2_top10_cleaned.csv" \
and "tmd_q2_bottom_cleaned.csv"for analysis to answer Q2.' + '\033[0m')

tmd_q2_top10.to_csv('tmd_q2_top10_cleaned.csv', index = False)

tmd_q2_bottom10.to_csv('tmd_q2_bottom10_cleaned.csv', index = False)

Saving cleaned data as csv files "tmd_q2_top10_cleaned.csv" and "tmd_q2_bottom_cleaned.csv"for analysis to answer Q2.